<?php
$I = new AcceptanceTester($scenario);
$I->wantTo('ensure that StaticPage view works');
$I->amOnPage('basic/web/index.php?r=static-page/view-alias&alias=about');
$I->see('Про кафедру');
$I->see('Кафедра є випусковою');
$I->seeLink('Новини кафедри');
$I->seeLink('Історія кафедри');
$I->click('Історія кафедри');

$I->see('Історія кафедри');
$I->see('Кафедра створена');
$I->seeLink('Новини кафедри');
$I->seeLink('Методична робота');
$I->click('Методична робота');

$I->see('Методична робота');
$I->seeLink('Новини кафедри');
$I->seeLink('Організаційна робота');
$I->click('Організаційна робота');

$I->see('Організаційна робота');
$I->seeLink('Новини кафедри');
$I->seeLink('Практична підготовка студентів');
$I->click('Практична підготовка студентів');

$I->see('Практична підготовка студентів');
$I->seeLink('Новини кафедри');
$I->seeLink('Навчальні лабораторії');
$I->click('Навчальні лабораторії');

$I->see('Матеріально-технічна база');
$I->seeLink('Новини кафедри');
$I->seeLink('Напрям підготовки 6.100202 Процеси, машини та обладнання агропромислового виробництва');
$I->click('Напрям підготовки 6.100202 Процеси, машини та обладнання агропромислового виробництва');

$I->see('Напрям підготовки 6.100202 Процеси, машини та обладнання агропромислового виробництва');
$I->seeLink('Новини кафедри');
$I->seeLink('Заочна форма навчання');
$I->click('Заочна форма навчання');

$I->see('Заочна форма навчання');
$I->seeLink('Новини кафедри');
$I->seeLink('Навчальні плани');
$I->click('Навчальні плани');

$I->see('Навчальні плани');
$I->seeLink('Новини кафедри');
$I->seeLink('Дипломнику');
$I->click('Дипломнику');

$I->see('Дипломнику');
$I->seeLink('Новини кафедри');
$I->seeLink('Корисні посилання');
$I->click('Корисні посилання');

$I->see('Корисні посилання');
$I->seeLink('Новини кафедри');
$I->seeLink('Програми практики');
$I->click('Програми практики');

$I->see('Програми практики');
$I->seeLink('Новини кафедри');
$I->seeLink('Напрямки наукових досліджень викладачів кафедри');
$I->click('Напрямки наукових досліджень викладачів кафедри');

$I->see('Напрямки наукових досліджень викладачів кафедри');
$I->seeLink('Новини кафедри');
$I->seeLink('Наукова робота студентів');
$I->click('Наукова робота студентів');

$I->see('Наукова робота студентів');
$I->seeLink('Новини кафедри');
$I->seeLink('Пропозиції виробникам');
$I->click('Пропозиції виробникам');

$I->see('Пропозиції виробникам');
$I->seeLink('Новини кафедри');
$I->seeLink('Аспіранти кафедри');
$I->click('Аспіранти кафедри');

$I->see('Аспіранти кафедри');
$I->seeLink('Новини кафедри');