<?php
/* @var $this yii\web\View */
?>
<h1>Кафедра процесів, машин та обладнання агропромислового виробництва</h1>

<p>
    Кафедра є випусковою і здійснює підготовку фахівців інженерної служби з механізації агропромислового виробництва освітньо-кваліфікаційних рівнів «Бакалавр», «Спеціаліст» і «Магістр» денної та заочної форми навчання.
</p>

<p>
    Сьогодні на кафедрі викладається понад 30 навчальних дисциплін, а також здійснюється підготовка водіїв категорії «В». У навчальному процесі використовуються лекційні аудиторії, комп’ютеризовані класи, спеціалізовані лабораторії, а також сільськогосподарські машини та обладнання, призначені для виконання різних механізованих технологічних операцій у виробництві сільськогосподарської продукції.
</p>


