<?php
/* @var $this yii\web\View */
?>
<h1>Історія кафедри</h1>

<p>
    <p>Кафедра створена в 1929 році, коли Уманський агрополітехнікум був реорганізований в Уманський сільськогосподарський інститут. Першим завідувачем кафедри був професор В.Ф. Чалий. Матеріальна база кафедри в перші роки складалася з машин і знарядь на кінній тязі. У 1935-1941 роках кафедра поповнилася тракторами, машинами на тракторній тязі, молотарками та ін.</p>

	<p>У 1944 році кафедру очолив доцент К.П. Моторний. Під його керівництвом було багато зроблено, щоб налагодити належний навчальний процес і поповнити матеріальну базу кафедри.</p>

	<p>У 1949-1955 роках кафедрою завідував доцент Г.І. Фіщенко. При ньому на кафедрі було розроблено конструкцію машин для підземного поливу сільськогосподарських культур.</p>

	<p>У 1956-1960 роках кафедрою керував доцент В.Г. Красько. У цей час на кафедрі розроблялася комплексна тема, що включала питання механізації обробітку ґрунту в плодоносних садах.</p>

	<p>У 1960 році на чолі кафедри став кандидат технічних наук К.С. Хвиля. Технічна база зросла за рахунок тракторів нових марок, сільськогосподарських машин та іншого обладнання. Були споруджені нові приміщення. Поруч з кафедрою розбито полігон для проходження навчальної практики.</p>

	<p>Значний вклад у розвиток кафедри також зробили завідувач кафедри М.К. Сінгур (1973-1983 рр.), доценти П.А. Рубан, П.В. Гончаренко та ін.</p>

	<p>У 1983-2009 роках кафедру очолював кандидат технічних наук, доцент В.І. Марченко. За цей час матеріально-технічна база кафедри поповнилась новими тракторами та с.-г. машинами, було налагоджено співпрацю з ВАТ «Уманьферммаш» та ЗАТ «Райз».</p>

	<p>У 2009-2010 роках обов’язки завідувача кафедри виконував кандидат сільськогосподарських наук, доцент Березовський Андрій Павлович.</p>

	<p>У 2010-2012 рр.завідувачем кафедри був кандидат технічних наук, доцент Войтік Андрій Володимирович.</p>

	<p>У 2012-2014 рр.завідувачем кафедри був кандидат технічних наук, професор Вольвак Сергій Федорович.</p>

	<p>З 2014 року кафедрою завідує кандидат технічних наук, доцент Войтік Андрій Володимирович.</p>
</p>
