<?php
/* @var $this yii\web\View */
?>
<h1>Методична робота</h1>

<p>
   Викладачі кафедри беруть активну участь у виданні підручників, посібників, методичних вказівок і наукових праць. 
   Навчальний процес забезпечений кафедральними науково-методичними розробками. Видані підручники і навчальні посібники: 
   «Сільськогосподарські машини», «Ґрунтообробні машини», «Машини сільськогосподарські», «Комбайни зернозбиральні», 
   «Системи технологій у рослинництві», «Мобільні енергетичні засоби», «Машиновикористання в землеробстві», 
   «Машиновикористання та екологія довкілля», 
   «Будова і технічне обслуговування тракторів і автомобілів», «Деталі машин. Курсове проектування» та ін.
</p>
