<?php
/* @var $this yii\web\View */
?>
<h1>Практична підготовка студентів</h1>

<p>
    Належна увага приділяється практичній підготовці майбутніх фахівців. Студенти проходять навчальну практику на кафедральному полігоні і виробничу в умовах навчально-дослідного господарства та інших господарств регіону, де мають можливість працювати і самостійно готувати до роботи машинно-тракторні агрегати і виконувати механізовані технологічні операції. Практичні заняття з підготовки водіїв здійснюються на сучасних автомобілях.
</p>
