<?php
$I = new AcceptanceTester($scenario);
$I->wantTo('ensure that News index page and view works');
$I->amOnPage('basic/web/index.php?r=news/index');
$I->see('ПМОАПВ');
$I->see('Навчально-методичне');
$I->see('Інтернаціональний');
$I->see('Новини');
$I->seeLink('Новини кафедри');
$I->seeLink('Контакти');
$I->seeLink('Методичні вказівки');
$I->seeLink('Войтік Андрій Володимирович');
$I->seeLink('Свято-конкурс робітничих професій на кафедрі процесів, машин та обладнання АПВ');
$I->click('Свято-конкурс робітничих професій на кафедрі процесів, машин та обладнання АПВ');
$I->see('Свято-конкурс робітничих професій на кафедрі процесів, машин та обладнання АПВ');
$I->see('Опубліковано');


